schreibfaul1/ESP32-MiniWebRadio/src/common.h
        if(m_browseOnRelease == 1){ m_dlna->browseServer(m_currDLNAsrvNr, "0", 0 , 9);}
        if(m_browseOnRelease == 2){ m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, 0 , 9);}
        if(m_browseOnRelease == 3){ m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, 0 , 9);}
        if(m_browseOnRelease == 4){ m_dlna->browseServer(m_currDLNAsrvNr, m_dlnaHistory[*m_dlnaLevel].objId, m_currItemNr , 9);}
        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        m_ra.val1 = 0;
        return true;
    }
private:
    void dlnaItemsList(){
        if(!m_buff) m_buff = x_ps_malloc(512);
        uint16_t itemsSize = 0;
        if(*m_dlnaLevel == 0) {
            itemsSize = m_dlnaServer.size;
        }
        else { itemsSize = m_srvContent.size; }

        auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) {  tft.fillTriangle(x + s, y + 0, x + 0, y + 2  *  s, x + 2  *  s, y + 2  *  s, TFT_RED); };
        auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) {  tft.fillTriangle(x + 0, y + 0, x + 2  *  s, y + 0, x + s, y + 2  *  s, TFT_RED); };

        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        tft.setFont(m_fontSize);
        tft.setTextColor(TFT_ORANGE);
        tft.writeText(m_dlnaHistory[*m_dlnaLevel].name, 10, m_y, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, true, true);
        tft.setTextColor(TFT_WHITE);
        for(uint8_t pos = 1; pos < 10; pos++) {
            if(pos == 1 && m_currItemNr > 0) { triangleUp(0, m_y + (pos * m_lineHight), m_lineHight / 3.5); }
            if(pos == 9 && m_currItemNr + 9 < m_dlnaMaxItems) { triangleDown(0, m_y + (pos * m_lineHight), m_lineHight / 3.5); }
            if(pos > 9) break;
            if(pos > itemsSize) break;
            if(*m_dlnaLevel == 0) { tft.writeText(m_dlnaServer.friendlyName[pos - 1], 20, m_y + (pos) * m_lineHight, m_w- 20, m_lineHight, TFT_ALIGN_LEFT, true, true); }
            else {
                if(startsWith(m_srvContent.itemURL[pos - 1], "http")) {
                    if(m_srvContent.isAudio[pos - 1] == true) {
                        if(m_srvContent.duration[pos - 1][0] != '?') { sprintf(m_buff, ANSI_ESC_YELLOW "%s" ANSI_ESC_CYAN " (%s)", m_srvContent.title[pos - 1], m_srvContent.duration[pos - 1]); }
                        else { sprintf(m_buff, ANSI_ESC_YELLOW "%s" ANSI_ESC_CYAN " (%li)", m_srvContent.title[pos - 1], (long int)m_srvContent.itemSize[pos - 1]); }
                    }
                    else { sprintf(m_buff, ANSI_ESC_WHITE "%s" ANSI_ESC_CYAN " (%li)", m_srvContent.title[pos - 1], (long int)m_srvContent.itemSize[pos - 1]); }
                }
                else {
                    if(m_srvContent.childCount[pos - 1] == 0) { sprintf(m_buff, ANSI_ESC_WHITE "%s", m_srvContent.title[pos - 1]); }
                    else { sprintf(m_buff, ANSI_ESC_WHITE "%s" ANSI_ESC_CYAN " (%i)", m_srvContent.title[pos - 1], m_srvContent.childCount[pos - 1]); }
                }
                tft.writeText(m_buff, 20, m_y + (pos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, true, true);
            }
        }
        if(m_buff){free(m_buff); m_buff = NULL;}
        return;
    }
    void hasClicked(uint16_t x, uint16_t y){
        if(!m_buff) m_buff = x_ps_malloc(512);
        m_itemListPos = y / (m_h / 10);

        if(m_oldY && (m_oldY + 2 *m_lineHight < y)) {
            m_ra.val1 = 0;
            *m_dlnaLevel = m_oldDlnaLevel;
            if(m_currItemNr == 0) goto exit;
            if(m_currItemNr >  9) m_currItemNr -= 9;
            else m_currItemNr = 0;
            m_browseOnRelease = 4;
            m_chptr = NULL;
        }
        if(m_oldY && (m_oldY - 2* m_lineHight > y)) {
            m_ra.val1 = 0;
            *m_dlnaLevel = m_oldDlnaLevel;
            if(m_currItemNr + 9 >= m_dlnaMaxItems) goto exit;
            m_currItemNr += 9;
            m_browseOnRelease = 4;
            m_chptr = NULL;
        }

        if(m_oldX || m_oldY) goto exit;
        m_oldX = x; m_oldY = y;
        m_oldDlnaLevel = *m_dlnaLevel;
        if(*m_dlnaLevel == 0){  // server list
            m_chptr = m_dlnaServer.friendlyName[m_itemListPos - 1];
            m_currDLNAsrvNr = m_itemListPos - 1;
            (*m_dlnaLevel) ++;
            if(m_dlnaHistory[*m_dlnaLevel].name){free(m_dlnaHistory[*m_dlnaLevel].name); m_dlnaHistory[*m_dlnaLevel].name = NULL;}
            m_dlnaHistory[*m_dlnaLevel].name = strdup(m_dlnaServer.friendlyName[m_itemListPos - 1]);
            m_browseOnRelease = 1;
        }
        else {  // content list
            if(m_itemListPos == 0){
                (*m_dlnaLevel) --;
                m_browseOnRelease = 2;
            }
            else if(startsWith(m_srvContent.itemURL[m_itemListPos - 1], "http")){ // is file
                if(m_srvContent.isAudio[m_itemListPos - 1]){
                    sprintf(m_buff, "%s",m_srvContent.title[m_itemListPos - 1]);
                    m_chptr = m_buff;
                    m_ra.arg1 = m_srvContent.itemURL[m_itemListPos - 1]; // url --> connecttohost()
                    m_ra.arg2 = m_srvContent.title[m_itemListPos - 1];   // filename --> showFileName()
                    if(m_ra.arg1 && m_ra.arg2) m_ra.val1 = 1;
                    m_browseOnRelease = 0;
                }
            }
            else{ // is folder
                sprintf(m_buff, "%s (%d)",m_srvContent.title[m_itemListPos - 1], m_srvContent.childCount[m_itemListPos - 1]);
                (*m_dlnaLevel) ++;
                m_chptr = m_buff;
                if(m_dlnaHistory[*m_dlnaLevel].objId){free(m_dlnaHistory[*m_dlnaLevel].objId); m_dlnaHistory[*m_dlnaLevel].objId = NULL;}
                m_dlnaHistory[*m_dlnaLevel].objId = strdup(m_srvContent.objectId[m_itemListPos -1]);
                if(m_dlnaHistory[*m_dlnaLevel].name){free(m_dlnaHistory[*m_dlnaLevel].name); m_dlnaHistory[*m_dlnaLevel].name = NULL;}
                m_dlnaHistory[*m_dlnaLevel].name = strdup(m_srvContent.title[m_itemListPos - 1]);
                m_browseOnRelease = 3;
            }
        }
exit:
        return;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class fileList{
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint16_t    m_fileListNr = 0;
    uint8_t     m_fontSize = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
public:
    fileList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("alarmClock");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~fileList(){
        if(m_name){free(m_name); m_name = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_fontSize = fontSize;
        m_enabled = false;
    }
    void show(uint16_t fileListNr){
        m_clicked = false;
        m_enabled = true;
        m_fileListNr = fileListNr;
        audioFileslist();
        ;
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        return true;
    }
private:
    void audioFileslist(){
        auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + s, y + 0, x + 0, y + 2 * s, x + 2 * s, y + 2 * s, TFT_RED); };
        auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + 0, y + 0, x + 2 * s, y + 0, x + s, y + 2 * s, TFT_RED); };

    //    clearWithOutHeaderFooter();
        if(_SD_content.getSize() < 10) m_fileListNr = 0;
        // showHeadlineItem(AUDIOFILESLIST);
        tft.setFont(m_fontSize);
        uint8_t lineHight = m_h / 10;
        tft.setTextColor(TFT_ORANGE);
   //     tft.writeText(_curAudioFolder.c_str(), 10, m_y, m_w - 10, lineHight, TFT_ALIGN_LEFT, true, true);
        tft.setTextColor(TFT_WHITE);
        for(uint8_t pos = 1; pos < 10; pos++) {
            if(pos == 1 && m_fileListNr > 0) {
                tft.setTextColor(TFT_AQUAMARINE);
                triangleUp(0, m_y + (pos * lineHight), lineHight / 3.5);
            }
            if(pos == 9 && m_fileListNr + 9 < _SD_content.getSize()) {
                tft.setTextColor(TFT_AQUAMARINE);
                triangleDown(0, m_y + (pos * lineHight), lineHight / 3.5);
            }
            if(m_fileListNr + pos > _SD_content.getSize()) break;
            if(indexOf(_SD_content.getIndex(pos + m_fileListNr - 1), "\033[", 0) == -1) tft.setTextColor(TFT_GRAY); // is folder
            else tft.setTextColor(TFT_WHITE);                                                            // is file
            tft.writeText(_SD_content.getIndex(pos + m_fileListNr - 1), 20, m_y + (pos)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, true, true);
        }
    //    _timeCounter.timer = 10;
    //    _timeCounter.factor = 1.0;
    }
    void hasClicked(uint16_t x, uint16_t y){
        ;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class stationsList{
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
public:
    stationsList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("alarmClock");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~stationsList(){
        if(m_name){free(m_name); m_name = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
    }
    void show(){
        m_clicked = false;
        m_enabled = true;
        ;
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        return true;
    }
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
